Enterprise_Serivces/Prod/Bronze2/CSLEmployeeService/WSDL/EmployeeService/EmployeeService.svc_singleWsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="EmployeeService" targetNamespace="http://services.gamestop.com/humanresources/payroll/employeeservice/V1.0" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://services.gamestop.com/humanresources/payroll/employeeservice/V1.0" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="http://www.gamestop.com/services/core/contracts/2010/05" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://www.gamestop.com/services/core/contracts/2010/05"><xs:import namespace="http://www.gamestop.com/services/core/messages/2010/08"/><xs:element name="GetVersion"><xs:complexType><xs:sequence/></xs:complexType></xs:element><xs:element name="GetVersionResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="GetVersionResult" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="IsServiceAlive"><xs:complexType><xs:sequence/></xs:complexType></xs:element><xs:element name="IsServiceAliveResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="IsServiceAliveResult" nillable="true" type="q1:IsServiceAliveResponse" xmlns:q1="http://www.gamestop.com/services/core/messages/2010/08"/></xs:sequence></xs:complexType></xs:element><xs:element name="IsServiceHealthy"><xs:complexType><xs:sequence/></xs:complexType></xs:element><xs:element name="IsServiceHealthyResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="IsServiceHealthyResult" nillable="true" type="q2:IsServiceHealthyResponse" xmlns:q2="http://www.gamestop.com/services/core/messages/2010/08"/></xs:sequence></xs:complexType></xs:element></xs:schema><xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/"><xs:element name="anyType" nillable="true" type="xs:anyType"/><xs:element name="anyURI" nillable="true" type="xs:anyURI"/><xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/><xs:element name="boolean" nillable="true" type="xs:boolean"/><xs:element name="byte" nillable="true" type="xs:byte"/><xs:element name="dateTime" nillable="true" type="xs:dateTime"/><xs:element name="decimal" nillable="true" type="xs:decimal"/><xs:element name="double" nillable="true" type="xs:double"/><xs:element name="float" nillable="true" type="xs:float"/><xs:element name="int" nillable="true" type="xs:int"/><xs:element name="long" nillable="true" type="xs:long"/><xs:element name="QName" nillable="true" type="xs:QName"/><xs:element name="short" nillable="true" type="xs:short"/><xs:element name="string" nillable="true" type="xs:string"/><xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/><xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/><xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/><xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/><xs:element name="char" nillable="true" type="tns:char"/><xs:simpleType name="char"><xs:restriction base="xs:int"/></xs:simpleType><xs:element name="duration" nillable="true" type="tns:duration"/><xs:simpleType name="duration"><xs:restriction base="xs:duration"><xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/><xs:minInclusive value="-P10675199DT2H48M5.4775808S"/><xs:maxInclusive value="P10675199DT2H48M5.4775807S"/></xs:restriction></xs:simpleType><xs:element name="guid" nillable="true" type="tns:guid"/><xs:simpleType name="guid"><xs:restriction base="xs:string"><xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/></xs:restriction></xs:simpleType><xs:attribute name="FactoryType" type="xs:QName"/><xs:attribute name="Id" type="xs:ID"/><xs:attribute name="Ref" type="xs:IDREF"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://www.gamestop.com/services/core/messages/2010/08" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://www.gamestop.com/services/core/messages/2010/08"><xs:complexType name="IsServiceAliveResponse"><xs:sequence><xs:element minOccurs="0" name="IsAlive" type="xs:boolean"/></xs:sequence></xs:complexType><xs:element name="IsServiceAliveResponse" nillable="true" type="tns:IsServiceAliveResponse"/><xs:complexType name="IsServiceHealthyResponse"><xs:sequence><xs:element minOccurs="0" name="IsHealthy" type="xs:boolean"/></xs:sequence></xs:complexType><xs:element name="IsServiceHealthyResponse" nillable="true" type="tns:IsServiceHealthyResponse"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://services.gamestop.com/humanresources/payroll/employeeservice/messagetypes/V1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://services.gamestop.com/humanresources/payroll/employeeservice/messagetypes/V1.0"><xs:import namespace="http://services.gamestop.com/humanresources/payroll/employeeservice/V1.0"/><xs:element name="GetTimeSheetsByStoreRequest"><xs:complexType><xs:sequence><xs:element minOccurs="0" ref="q1:PayPeriod" xmlns:q1="http://services.gamestop.com/humanresources/payroll/employeeservice/V1.0"/><xs:element minOccurs="0" ref="q2:StoreNumber" xmlns:q2="http://services.gamestop.com/humanresources/payroll/employeeservice/V1.0"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetTimeSheetsByStoreResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" ref="q3:TimeSheets" xmlns:q3="http://services.gamestop.com/humanresources/payroll/employeeservice/V1.0"/></xs:sequence></xs:complexType></xs:element></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://services.gamestop.com/humanresources/payroll/employeeservice/V1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:import namespace="http://schemas.microsoft.com/2003/10/Serialization/"/><xs:import namespace="http://schema.gamestop.com/humanresources/payroll/employeeservice/entities/V1.0"/><xs:element name="PayPeriod" nillable="true" type="xs:string"/><xs:element name="StoreNumber" nillable="true" type="xs:string"/><xs:element name="CorrelationID" type="q1:guid" xmlns:q1="http://schemas.microsoft.com/2003/10/Serialization/"/><xs:element name="MachineName" nillable="true" type="xs:string"/><xs:element name="TimeSheets" nillable="true" type="q2:ArrayOfTimeSheet" xmlns:q2="http://schema.gamestop.com/humanresources/payroll/employeeservice/entities/V1.0"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schema.gamestop.com/humanresources/payroll/employeeservice/entities/V1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schema.gamestop.com/humanresources/payroll/employeeservice/entities/V1.0"><xs:complexType name="ArrayOfTimeSheet"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="TimeSheet" nillable="true" type="tns:TimeSheet"/></xs:sequence></xs:complexType><xs:element name="ArrayOfTimeSheet" nillable="true" type="tns:ArrayOfTimeSheet"/><xs:complexType name="TimeSheet"><xs:sequence><xs:element name="EmployeeID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="LocalClockInTime" nillable="true" type="xs:dateTime"/><xs:element minOccurs="0" name="LocalClockOutTime" nillable="true" type="xs:dateTime"/><xs:element name="PayPeriodEndDate" type="xs:dateTime"/><xs:element name="PayPeriodStartDate" type="xs:dateTime"/><xs:element name="TimeSheetSegmentID" type="xs:int"/><xs:element minOccurs="0" name="UtcClockInTime" nillable="true" type="xs:dateTime"/><xs:element minOccurs="0" name="UtcClockOutTime" nillable="true" type="xs:dateTime"/></xs:sequence></xs:complexType><xs:element name="TimeSheet" nillable="true" type="tns:TimeSheet"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://www.gamestop.com/services/core/contracts/faults/2010/05" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://www.gamestop.com/services/core/contracts/faults/2010/05" xmlns:ser="http://schemas.microsoft.com/2003/10/Serialization/"><xs:import namespace="http://schemas.microsoft.com/2003/10/Serialization/"/><xs:complexType name="SenderFaultDetail"><xs:sequence><xs:element name="FailedBodyElements" nillable="true" type="tns:ArrayOfFailedBodyElement"/><xs:element minOccurs="0" name="ReferenceID" type="ser:guid"/></xs:sequence></xs:complexType><xs:element name="SenderFaultDetail" nillable="true" type="tns:SenderFaultDetail"/><xs:complexType name="ArrayOfFailedBodyElement"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="FailedBodyElement" nillable="true" type="tns:FailedBodyElement"/></xs:sequence></xs:complexType><xs:element name="ArrayOfFailedBodyElement" nillable="true" type="tns:ArrayOfFailedBodyElement"/><xs:complexType name="FailedBodyElement"><xs:sequence><xs:element name="Name" nillable="true" type="xs:string"/><xs:element name="Message" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Tag" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="FailedBodyElement" nillable="true" type="tns:FailedBodyElement"/><xs:complexType name="ReceiverFaultDetail"><xs:sequence><xs:element name="Message" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Description" nillable="true" type="xs:string"/><xs:element name="ContactAdministrator" type="xs:boolean"/><xs:element minOccurs="0" name="ReferenceID" type="ser:guid"/></xs:sequence></xs:complexType><xs:element name="ReceiverFaultDetail" nillable="true" type="tns:ReceiverFaultDetail"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://www.gamestop.com/services/core/contracts/faults/2011/04" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://www.gamestop.com/services/core/contracts/faults/2011/04"><xs:complexType name="ExpectedFaultDetail"><xs:sequence><xs:element name="FaultCode" nillable="true" type="xs:string"/><xs:element name="Message" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="ExpectedFaultDetail" nillable="true" type="tns:ExpectedFaultDetail"/></xs:schema></wsdl:types><wsdl:message name="IEmployeeService_GetVersion_InputMessage"><wsdl:part name="parameters" element="q1:GetVersion" xmlns:q1="http://www.gamestop.com/services/core/contracts/2010/05"/></wsdl:message><wsdl:message name="IEmployeeService_GetVersion_OutputMessage"><wsdl:part name="parameters" element="q2:GetVersionResponse" xmlns:q2="http://www.gamestop.com/services/core/contracts/2010/05"/></wsdl:message><wsdl:message name="IEmployeeService_IsServiceAlive_InputMessage"><wsdl:part name="parameters" element="q3:IsServiceAlive" xmlns:q3="http://www.gamestop.com/services/core/contracts/2010/05"/></wsdl:message><wsdl:message name="IEmployeeService_IsServiceAlive_OutputMessage"><wsdl:part name="parameters" element="q4:IsServiceAliveResponse" xmlns:q4="http://www.gamestop.com/services/core/contracts/2010/05"/></wsdl:message><wsdl:message name="IEmployeeService_IsServiceHealthy_InputMessage"><wsdl:part name="parameters" element="q5:IsServiceHealthy" xmlns:q5="http://www.gamestop.com/services/core/contracts/2010/05"/></wsdl:message><wsdl:message name="IEmployeeService_IsServiceHealthy_OutputMessage"><wsdl:part name="parameters" element="q6:IsServiceHealthyResponse" xmlns:q6="http://www.gamestop.com/services/core/contracts/2010/05"/></wsdl:message><wsdl:message name="GetTimeSheetsByStoreRequest"><wsdl:part name="parameters" element="q7:GetTimeSheetsByStoreRequest" xmlns:q7="http://services.gamestop.com/humanresources/payroll/employeeservice/messagetypes/V1.0"/></wsdl:message><wsdl:message name="GetTimeSheetsByStoreRequest_Headers"><wsdl:part name="CorrelationID" element="tns:CorrelationID"/><wsdl:part name="MachineName" element="tns:MachineName"/></wsdl:message><wsdl:message name="GetTimeSheetsByStoreResponse"><wsdl:part name="parameters" element="q8:GetTimeSheetsByStoreResponse" xmlns:q8="http://services.gamestop.com/humanresources/payroll/employeeservice/messagetypes/V1.0"/></wsdl:message><wsdl:message name="IEmployeeService_GetTimeSheetsByStore_SenderFaultDetailFault_FaultMessage"><wsdl:part name="detail" element="q9:SenderFaultDetail" xmlns:q9="http://www.gamestop.com/services/core/contracts/faults/2010/05"/></wsdl:message><wsdl:message name="IEmployeeService_GetTimeSheetsByStore_ReceiverFaultDetailFault_FaultMessage"><wsdl:part name="detail" element="q10:ReceiverFaultDetail" xmlns:q10="http://www.gamestop.com/services/core/contracts/faults/2010/05"/></wsdl:message><wsdl:message name="IEmployeeService_GetTimeSheetsByStore_ExpectedFaultDetailFault_FaultMessage"><wsdl:part name="detail" element="q11:ExpectedFaultDetail" xmlns:q11="http://www.gamestop.com/services/core/contracts/faults/2011/04"/></wsdl:message><wsdl:portType name="IEmployeeService"><wsdl:operation name="GetVersion"><wsdl:input wsaw:Action="http://www.gamestop.com/services/core/contracts/2010/05/IServiceBase/GetVersion" message="tns:IEmployeeService_GetVersion_InputMessage"/><wsdl:output wsaw:Action="http://www.gamestop.com/services/core/contracts/2010/05/IServiceBase/GetVersionResponse" message="tns:IEmployeeService_GetVersion_OutputMessage"/></wsdl:operation><wsdl:operation name="IsServiceAlive"><wsdl:input wsaw:Action="http://www.gamestop.com/services/core/contracts/2010/05/IServiceBase/IsServiceAlive" message="tns:IEmployeeService_IsServiceAlive_InputMessage"/><wsdl:output wsaw:Action="http://www.gamestop.com/services/core/contracts/2010/05/IServiceBase/IsServiceAliveResponse" message="tns:IEmployeeService_IsServiceAlive_OutputMessage"/></wsdl:operation><wsdl:operation name="IsServiceHealthy"><wsdl:input wsaw:Action="http://www.gamestop.com/services/core/contracts/2010/05/IServiceBase/IsServiceHealthy" message="tns:IEmployeeService_IsServiceHealthy_InputMessage"/><wsdl:output wsaw:Action="http://www.gamestop.com/services/core/contracts/2010/05/IServiceBase/IsServiceHealthyResponse" message="tns:IEmployeeService_IsServiceHealthy_OutputMessage"/></wsdl:operation><wsdl:operation name="GetTimeSheetsByStore"><wsdl:input wsaw:Action="http://services.gamestop.com/humanresources/payroll/employeeservice/V1.0/IEmployeeService/GetTimeSheetsByStore" name="GetTimeSheetsByStoreRequest" message="tns:GetTimeSheetsByStoreRequest"/><wsdl:output wsaw:Action="http://services.gamestop.com/humanresources/payroll/employeeservice/V1.0/IEmployeeService/GetTimeSheetsByStoreResponse" name="GetTimeSheetsByStoreResponse" message="tns:GetTimeSheetsByStoreResponse"/><wsdl:fault wsaw:Action="http://services.gamestop.com/humanresources/payroll/employeeservice/V1.0/IEmployeeService/GetTimeSheetsByStoreSenderFaultDetailFault" name="SenderFaultDetailFault" message="tns:IEmployeeService_GetTimeSheetsByStore_SenderFaultDetailFault_FaultMessage"/><wsdl:fault wsaw:Action="http://services.gamestop.com/humanresources/payroll/employeeservice/V1.0/IEmployeeService/GetTimeSheetsByStoreReceiverFaultDetailFault" name="ReceiverFaultDetailFault" message="tns:IEmployeeService_GetTimeSheetsByStore_ReceiverFaultDetailFault_FaultMessage"/><wsdl:fault wsaw:Action="http://services.gamestop.com/humanresources/payroll/employeeservice/V1.0/IEmployeeService/GetTimeSheetsByStoreExpectedFaultDetailFault" name="ExpectedFaultDetailFault" message="tns:IEmployeeService_GetTimeSheetsByStore_ExpectedFaultDetailFault_FaultMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IEmployeeService" type="tns:IEmployeeService"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="GetVersion"><soap:operation soapAction="http://www.gamestop.com/services/core/contracts/2010/05/IServiceBase/GetVersion" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="IsServiceAlive"><soap:operation soapAction="http://www.gamestop.com/services/core/contracts/2010/05/IServiceBase/IsServiceAlive" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="IsServiceHealthy"><soap:operation soapAction="http://www.gamestop.com/services/core/contracts/2010/05/IServiceBase/IsServiceHealthy" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetTimeSheetsByStore"><soap:operation soapAction="http://services.gamestop.com/humanresources/payroll/employeeservice/V1.0/IEmployeeService/GetTimeSheetsByStore" style="document"/><wsdl:input name="GetTimeSheetsByStoreRequest"><soap:header message="tns:GetTimeSheetsByStoreRequest_Headers" part="CorrelationID" use="literal"/><soap:header message="tns:GetTimeSheetsByStoreRequest_Headers" part="MachineName" use="literal"/><soap:body use="literal"/></wsdl:input><wsdl:output name="GetTimeSheetsByStoreResponse"><soap:body use="literal"/></wsdl:output><wsdl:fault name="SenderFaultDetailFault"><soap:fault use="literal" name="SenderFaultDetailFault" namespace=""/></wsdl:fault><wsdl:fault name="ReceiverFaultDetailFault"><soap:fault use="literal" name="ReceiverFaultDetailFault" namespace=""/></wsdl:fault><wsdl:fault name="ExpectedFaultDetailFault"><soap:fault use="literal" name="ExpectedFaultDetailFault" namespace=""/></wsdl:fault></wsdl:operation></wsdl:binding><wsdl:service name="EmployeeService"><wsdl:port name="BasicHttpBinding_IEmployeeService" binding="tns:BasicHttpBinding_IEmployeeService"><soap:address location="http://cslemployeeserviceqa1.testgs.pvt/EmployeeService.svc"/></wsdl:port></wsdl:service></wsdl:definitions>