Enterprise_Serivces/Cert/Bronze2/CSLConfigurationService/result1/Iteration1/t6_http.xml

<?xml-stylesheet href="..\http.xsl" type="text/xsl"?>
<report vuGenInstallDir="C:\Program Files (x86)\HP\LoadRunner\">
  <http>
    <request>
      <header>POST /ConfigurationService.svc HTTP/1.1
Content-Type: text/xml; charset=utf-8
Cache-Control: no-cache
SOAPAction: "http://www.gamestop.com/services/core/contracts/2010/05/IServiceBase/IsServiceHealthy"
User-Agent: Mozilla/4.0 (compatible; MSIE 6.0; MS Web Services Client Protocol 1.1.4322.2032)
Accept-Encoding: gzip, deflate
Accept: */*
Connection: Keep-Alive
Host: cslconfigurationserviceqa1.testgs.pvt
Content-Length: 803

</header>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"&gt;
  &lt;soap:Header&gt;
    &lt;wsa:Action&gt;http://www.gamestop.com/services/core/contracts/2010/05/IServiceBase/IsServiceHealthy&lt;/wsa:Action&gt;
    &lt;wsa:MessageID&gt;uuid:71189676-4dc1-4daf-abf5-71c913d06147&lt;/wsa:MessageID&gt;
    &lt;wsa:ReplyTo&gt;
      &lt;wsa:Address&gt;http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous&lt;/wsa:Address&gt;
    &lt;/wsa:ReplyTo&gt;
    &lt;wsa:To&gt;http://cslconfigurationserviceqa1.testgs.pvt/ConfigurationService.svc&lt;/wsa:To&gt;
  &lt;/soap:Header&gt;
  &lt;soap:Body&gt;
    &lt;IsServiceHealthy xmlns="http://www.gamestop.com/services/core/contracts/2010/05" /&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;</body>
    </request>
    <response>
      <header>HTTP/1.1 200 OK
Cache-Control: private
Content-Length: 408
Content-Type: text/xml; charset=utf-8
Server: Microsoft-IIS/8.5
X-AspNet-Version: 4.0.30319
Date: Mon, 30 Jan 2017 16:51:02 GMT

</header>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s:Body&gt;
    &lt;IsServiceHealthyResponse xmlns="http://www.gamestop.com/services/core/contracts/2010/05"&gt;
      &lt;IsServiceHealthyResult xmlns:a="http://www.gamestop.com/services/core/messages/2010/08" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;
        &lt;a:IsHealthy&gt;true&lt;/a:IsHealthy&gt;
      &lt;/IsServiceHealthyResult&gt;
    &lt;/IsServiceHealthyResponse&gt;
  &lt;/s:Body&gt;
&lt;/s:Envelope&gt;</body>
    </response>
  </http>
</report>